Tekla Open API Reference for Tekla Structures 2025
DistanceList.Parse Method (String)
 Parses a distance list from a string representation.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static DistanceList Parse(
	string input
)
Public Shared Function Parse (
	input As String
) As DistanceList
Parameters
input
Type: System.String
The input string.
Return Value
Type: DistanceList
The distance list.
Examples
 This example shows how to parse distance lists with the current culture information and the current unit type.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // Current unit type controls the default unit type used in parsing.
           // The default unit is millimeter.
           Distance.CurrentUnitType = Distance.UnitType.Millimeter;
           // By default, the parsing uses the current unit type and the current culture info.
           // This will be parsed as 3 millimeters and 2 millimeters.
           DistanceList defaultFormat = DistanceList.Parse("3 2");
       }
}
See Also
Reference
DistanceList Structure
Parse Overload
Tekla.Structures.Datatype Namespace